W6D2/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Kevin"], ["email", "kevin@kevin.com"], ["updated_at", "2019-12-31 19:44:33.167737"], ["id", 3]]
---
    def update
        user = User.find(params[:id])

        if user.update(user_params)