W11D3/benchbnb-master/app/models/user.rb

  def reset_session_token!
    self.session_token = self.class.generate_session_token
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "EGAE9V8ZrqqTkAfprhm_xQ"], ["updated_at", "2020-02-05 22:09:00.693534"], ["id", 1]]