W6D5/ninety_nine_cats/app/controllers/cats_controller.rb

    def index
        # render json: Cat.all
        @cats = Cat.all
---
SELECT "cats".* FROM "cats"

    def show
        # render json: Cat.find(params[:id])
        @cat = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]

    def update
        new_info = Cat.find(params[:id])
        if new_info.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "color" = $2, "sex" = $3, "description" = $4, "updated_at" = $5 WHERE "cats"."id" = $6  [["birth_date", "2018-01-01"], ["color", "white"], ["sex", "F"], ["description", "Felix is a felicious cat"], ["updated_at", "2020-01-03 22:14:57.346093"], ["id", 24]]