W6D4/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 3], ["viewer_id", 3], ["created_at", "2020-01-02 16:27:33.780557"], ["updated_at", "2020-01-02 16:27:33.780557"]]
---
    def create
        share = ArtworkShare.new(artwork_share_params)

        if share.save

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 8]]
---
    def destroy
        share = ArtworkShare.find(params[:id])
        share.destroy