W6D4/app/controllers/artworks_controller.rb

    def index
        # owned_artwork = Artwork.find_by(artist_id: params[user_id])
        # shared_artwork = Artwork.find_by(viewer_id: params[viewer_id])
        user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        artwork = Artwork.new(artwork_params)

        if artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Land"], ["image_url", "fwfewef.com"], ["artist_id", 3]]

    def update
        artwork = Artwork.find(params[:id])

        if artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1 WHERE "artworks"."id" = $2  [["title", "Mountain"], ["id", 3]]

    def destroy
        artwork = Artwork.find(params[:id])
        artwork.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 3]]