W6D4/app/controllers/comments_controller.rb

    def index
        debugger
        if params[:user_id]
            user = User.find(params[:user_id])
            render json: user.comments
        else
            artwork = Artwork.find(params[:artwork_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        comment = Comment.new(comment_params)

        if comment.save
---
INSERT INTO "comments" ("body", "author_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Amazing Piece!"], ["author_id", 1], ["artwork_id", 4], ["created_at", "2020-01-02 19:38:20.567432"], ["updated_at", "2020-01-02 19:38:20.567432"]]

    def destroy
        comment = Comment.find(params[:id])
        comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]