W6D4/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Rich"], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
    def index
        if params[:username]
            user = User.where("username like '%#{params[:username]}%'")
            render json: user
        else
            render json: User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Jon"], ["email", "jon@jon.com"], ["created_at", "2019-12-31 19:28:13.411427"], ["updated_at", "2019-12-31 19:28:13.411427"]]
---
    def create
        debugger
        user = User.new(user_params)

        if user.save #instance model method

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        user = User.find(params[:id]) # User.find_by( id: params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Kevin"], ["email", "kevin@kevin.com"], ["updated_at", "2019-12-31 19:44:33.167737"], ["id", 3]]
---
    def update
        user = User.find(params[:id]) # class model method

        if user.update(user_params) # instance model method